app/controllers/airplanes_controller.rb

SELECT "airplanes".* FROM "airplanes"
---
    def index
        airplanes = Airplane.all

SELECT "airplanes".* FROM "airplanes" WHERE "airplanes"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def show
        airplane = Airplane.find(params[:id])