app/controllers/airports_controller.rb

  def index
    airports = Airport.all
---
SELECT "airports".* FROM "airports"

  def create
    new_airport = Airport.create!(airport_params)
---
INSERT INTO "airports" ("name", "abbrv", "plane_capacity", "created_at", "updated_at", "int") VALUES (?, ?, ?, ?, ?, ?)  [["name", "LaGuardia"], ["abbrv", "LGA"], ["plane_capacity", 11], ["created_at", "2022-12-16 19:05:00.236270"], ["updated_at", "2022-12-16 19:05:00.236270"], ["int", 1]]

  def update
    @airport.update!(airport_params)
---
UPDATE "airports" SET "plane_capacity" = ?, "updated_at" = ?, "int" = ? WHERE "airports"."id" = ?  [["plane_capacity", 7], ["updated_at", "2022-12-16 19:12:32.289877"], ["int", 0], ["id", 2]]

  def destroy
    # airport = Airport.find(params[:airport])
    @airport.destroy
---
DELETE FROM "airports" WHERE "airports"."id" = ?  [["id", 4]]

  def find_airport
    @airport = Airport.find(params[:id])
---
SELECT "airports".* FROM "airports" WHERE "airports"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]